{
    "submissions": [
        {
            "title": "Box office hits that destroyed people's careers",
            "submission_id": "cd21k0",
            "author": "mranimal2",
            "score": 17174,
            "created": 1563104160.0,
            "text": "Usually it's a flop that destroys someone's career not a hit. Can you think of any exceptions?\n\nAlice in Wonderland 2010. Burton and Depp have been in or made a lot of wide, studio released movies since that one but almost all of them have flopped. At least Depp has been in some hits since like Pirates of the Carribean 4&5, Rango, 21 Jump Street, Into the Woods, Black Mass (kinda), Fantastic Beasts 1, and Murder on the Orient Express. Burton hasn't had one hit since Alice in Wonderland. No matter what he does the movie flops or underperforms at the box office nowadays. Even when critics are like \"No, the movie's actually good\" like they did with Frankenweenie and Big Eyes, no one came. Even Dumbo couldn't turn things around. Dumbo! It seems like Alice in Wonderland pretty much killed any goodwill Burton had with people and they haven't seen a movie of his since. He could make the next Citizen Kane and, nowadays, people wouldn't come.",
            "comments": [
                {
                    "id": "ets55cv",
                    "author": "None",
                    "created": 1563136781.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "etshik8",
                            "author": "nananananana_FARTMAN",
                            "created": 1563145753.0,
                            "text": "Oh, yeah. I remember this. It actually wasn't Michael Bay that blacklisted her. It was Steven Spielberg. He was the executive producer for the series. He made *Schindler's List,* and that experience made him very sensitive around the whole Hitler and holocaust thing. So when she made a comment comparing Bay to Hitler, Spielberg was having none of that and removed her from the franchise.",
                            "replies": [
                                {
                                    "id": "etsja8k",
                                    "author": "flakula",
                                    "created": 1563147087.0,
                                    "text": "Was it making Schindlers List that made him sensitive, or his Jewish heritage?",
                                    "replies": [
                                        {
                                            "id": "etsk5l9",
                                            "author": "nananananana_FARTMAN",
                                            "created": 1563147744.0,
                                            "text": "Ah, you're right. He's Jewish. That definitely would factor in this story. I read that it was the experience making *Schindler's List* that made him sensitive. One example of this, after *Schindler's List,* Spielberg had a reflection on his making the Indiana Jones and questioned if he was appropriate with how he portrayed the Nazis as an archetypical villain. He felt like he didn't truly captured the evil of Nazis and worried that the audience would take the light take on Indy Jones's Nazis as an indictator of what they really were. I think I read this in The Men Who Would be Kings.",
                                            "replies": [
                                                {
                                                    "id": "etsmvjd",
                                                    "author": "None",
                                                    "created": 1563149852.0,
                                                    "text": "No movie can get me emotional like the ending of Schindler's list can. I imagine that directing that movie had a huge impact on him, especially considering his heritage.",
                                                    "replies": [
                                                        {
                                                            "id": "etsudmj",
                                                            "author": "Harsimaja",
                                                            "created": 1563155798.0,
                                                            "text": "Part of that is that it’s real. Not just the story it’s based on, but the last scene shows the real survivors giving Schindler a real tribute. It’s a wonderful film but it’s not just Spielberg’s talent that makes that ending.",
                                                            "replies": []
                                                        },
                                                        {
                                                            "id": "ett29jl",
                                                            "author": "None",
                                                            "created": 1563162278.0,
                                                            "text": "Stanley Kubrick kept trying to make a film about the holocaust in the early 90s but it didn't go anywhere because he got too depressed.",
                                                            "replies": []
                                                        },
                                                        {
                                                            "id": "etspvst",
                                                            "author": "MarkJanusIsAScab",
                                                            "created": 1563152209.0,
                                                            "text": "I can't even think about him dropping that ring without tearing up a bit.",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "etsjyo2",
                                    "author": "I_fail_at_memes",
                                    "created": 1563147599.0,
                                    "text": "And she did Nazi that coming...",
                                    "replies": []
                                },
                                {
                                    "id": "ett2600",
                                    "author": "None",
                                    "created": 1563162191.0,
                                    "text": "i thought she got blacklisted because she wouldnt do sexual favour for spielberg?",
                                    "replies": []
                                },
                                {
                                    "id": "ett424c",
                                    "author": "AdumbroDeus",
                                    "created": 1563163900.0,
                                    "text": "Oh, at first this sounded awful but now I'm on board, she deserves this.  \n\n\nWould be nice if this stuck with say... Gibson.",
                                    "replies": []
                                },
                                {
                                    "id": "ett6vvy",
                                    "author": "Yeast_Muncher",
                                    "created": 1563166648.0,
                                    "text": "Jews love blacklisting people in Hollywood. Kiss their feet and tread on eggshells or your careers gone. She’s lucky Spielberg didn’t have a casting couch too",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etsh5wo",
                            "author": "None",
                            "created": 1563145487.0,
                            "text": "Steven Speilberg was the one that told Bay to fire her. Bay eventually brought her back for those TMNT movies.",
                            "replies": [
                                {
                                    "id": "etsizre",
                                    "author": "None",
                                    "created": 1563146868.0,
                                    "text": "I have a feeling Spielberg is a closet ass-hole, and I don't mean in a sexual way. Rather hypocrite way. If Megan called Mike Hitler, why is that a concern of Steven?",
                                    "replies": [
                                        {
                                            "id": "etsj7ut",
                                            "author": "dickheadfartface",
                                            "created": 1563147036.0,
                                            "text": "Why did you hyphenate asshole?",
                                            "replies": [
                                                {
                                                    "id": "etsjh9f",
                                                    "author": "germinik",
                                                    "created": 1563147235.0,
                                                    "text": "Past experiences.  Okay?",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ett3i10",
                            "author": "MrsNLupin",
                            "created": 1563163383.0,
                            "text": "Wasn't her \"audition\" for that movie washing his car in a bikini or something similarly gross?",
                            "replies": []
                        },
                        {
                            "id": "etsjfxa",
                            "author": "p3ngwin",
                            "created": 1563147207.0,
                            "text": "That's what happens when you literally call the director \"**Hitler**\". \n\n>*It all started when Fox gave an interview to London's Wonderland Magazine before filming began on the third installment.* ***\"\\[Bay\\] wants to be like Hitler on his sets, and he is,\"*** *she said.* ***\"So he's a nightmare to work for but when you get him away from set, and he's not in director mode, I kind of really enjoy his personality because he's so awkward, so hopelessly awkward.\"***  \n>  \n>***\"He has no social skills at all,\"*** *she continued.* ***\"And it's endearing to watch him. He's vulnerable and fragile in real life and then on set he's a tyrant.\"***  \n>  \n> Fox's former co-star [Shia LaBeouf](http://abcnews.go.com/Entertainment/video/whoopi-goldberg-criticizes-shia-labeouf-over-steven-spielberg-remarks-10689415) told GQ: ***\"She started s\\*\\*\\* talking our captain. Which you can't do.\"*** \n\n [https://abcnews.go.com/Entertainment/steven-spielberg-fired-megan-fox-hitler-comment-transformer/story?id=13884212](https://abcnews.go.com/Entertainment/steven-spielberg-fired-megan-fox-hitler-comment-transformer/story?id=13884212)",
                            "replies": []
                        },
                        {
                            "id": "etsxm5k",
                            "author": "yimingwuzere",
                            "created": 1563158400.0,
                            "text": "She worked on TMNT later which Bay produced so this narrative is probably false.",
                            "replies": []
                        },
                        {
                            "id": "etsxwf1",
                            "author": "MRmandato",
                            "created": 1563158632.0,
                            "text": "He did put here in the Ninja Turtles movies",
                            "replies": []
                        },
                        {
                            "id": "ett0ifi",
                            "author": "jimdesroches",
                            "created": 1563160761.0,
                            "text": "Well Michael bay got to us too, that’s why we kept it quiet.",
                            "replies": []
                        },
                        {
                            "id": "ettvlp3",
                            "author": "None",
                            "created": 1563197344.0,
                            "text": "didnt bay basically give her the lead in the TMNT reboot movies a few years later? she did get another shot",
                            "replies": []
                        },
                        {
                            "id": "eu8zbob",
                            "author": "TagProTyrus",
                            "created": 1563568112.0,
                            "text": "Isn't blacklisting illegal?",
                            "replies": []
                        },
                        {
                            "id": "etshmk3",
                            "author": "xraig88",
                            "created": 1563145839.0,
                            "text": "Also, she’s a shitty actor.",
                            "replies": []
                        },
                        {
                            "id": "etsky46",
                            "author": "mwaters2",
                            "created": 1563148354.0,
                            "text": "Are you entirely sure it wasnt because she was a terrible actress and was ONLY hot",
                            "replies": []
                        },
                        {
                            "id": "etspfa6",
                            "author": "catsarefukincool",
                            "created": 1563151849.0,
                            "text": "Bay might of been mysoginistic and an asshole none of which are okay, but she's comparing him to Hitler, a man who murdered HUNDREDS AND THOUSANDS of people that's some untrue and incomparable stuff.\n\n\n\nAll her movies sucked anyway.",
                            "replies": [
                                {
                                    "id": "etsz10j",
                                    "author": "THANATOS4488",
                                    "created": 1563159520.0,
                                    "text": "6 million Jews alone, so it's even dumber",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etswqz7",
                            "author": "canadiangirl_eh",
                            "created": 1563157692.0,
                            "text": "Also, she couldn’t act.",
                            "replies": []
                        },
                        {
                            "id": "ett0bms",
                            "author": "GetToTheChopperNOW",
                            "created": 1563160602.0,
                            "text": "To be fair though, Megan Fox isn't the greatest actress in the world.  She's eye candy and not much more.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsmbeg",
                    "author": "Verbi563",
                    "created": 1563149417.0,
                    "text": "Im not sure if anyone mentioned him, but i would say Hayden Christensen after Prequels trilogy",
                    "replies": []
                },
                {
                    "id": "etsmbvm",
                    "author": "hhhiigftyuhhii",
                    "created": 1563149427.0,
                    "text": "Daniel radcliff and Rupert Grint after Harry Potter",
                    "replies": [
                        {
                            "id": "etsmxae",
                            "author": "theinquisition",
                            "created": 1563149891.0,
                            "text": "Rupert is in the new abc murders show and it's fantastic",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsmcjc",
                    "author": "Porndude1980",
                    "created": 1563149441.0,
                    "text": "Daniel Radcliffe after Harry Potter series",
                    "replies": [
                        {
                            "id": "etsmrt0",
                            "author": "Lastaria",
                            "created": 1563149773.0,
                            "text": "His career is doing great. He has the luxury to chose his roles because Harry Potter money set him up for life. He has been in lads of movies since. But he purposely has not chosen big franchise movies.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsmttd",
                    "author": "I-Am-Worthless",
                    "created": 1563149814.0,
                    "text": "Mr. Deeds was a box office hit yet Winona Ryder’s career almost completely dozed after it. That may have nothing to do with the movie tho.",
                    "replies": []
                },
                {
                    "id": "etrhzv5",
                    "author": "dont_worry_im_here",
                    "created": 1563121436.0,
                    "text": "ITT: People's careers that have tanked but not due to their box office hits. \n\nThere's no real answer to this question. *Nobody's* career has been destroyed because of a box office hit... other than Passion of the Christ dude, Jim Chaveasel or whatever. But his career was ruined when he signed on to the project. It being a monster at the box office had no affect on his career; it was the choice to be in the movie that ruined his career.",
                    "replies": [
                        {
                            "id": "etrp891",
                            "author": "nhammen",
                            "created": 1563126116.0,
                            "text": "I looked through this comment section, and the only one I agreed with was Terrence Howard and Iron Man.",
                            "replies": []
                        },
                        {
                            "id": "etrqm04",
                            "author": "chainmailbill",
                            "created": 1563126983.0,
                            "text": "(Jim Caviezel starred in five seasons of Person of Interest, a successful TV show)",
                            "replies": [
                                {
                                    "id": "etrr4bo",
                                    "author": "dont_worry_im_here",
                                    "created": 1563127303.0,
                                    "text": "True, he also never really had a huge career to begin with. I was merely going off of popular trade talk around the time of passion's release. It was a hot cliche to state the move to play jesus was a career ender.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etrla8s",
                            "author": "bloodclart",
                            "created": 1563123588.0,
                            "text": "His career was ruined because he’s a self righteous christian/conservative douche bag.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrrb16",
                    "author": "None",
                    "created": 1563127418.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "etrt5xj",
                            "author": "shibbyd",
                            "created": 1563128565.0,
                            "text": "Yeah, bit he's gonna be the next Batman...",
                            "replies": []
                        },
                        {
                            "id": "etrt66g",
                            "author": "BannerHulk",
                            "created": 1563128569.0,
                            "text": "That’s a lie right there. Pattinson has been doing very well in indie films making a name for herself.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrxkel",
                    "author": "everythangspeachie",
                    "created": 1563131408.0,
                    "text": "Stifler",
                    "replies": [
                        {
                            "id": "etsjp2b",
                            "author": "None",
                            "created": 1563147396.0,
                            "text": "[deleted]",
                            "replies": [
                                {
                                    "id": "etsjsuj",
                                    "author": "everythangspeachie",
                                    "created": 1563147475.0,
                                    "text": "Ok goon was dope, isnt he on a show now?\n\nEather way most of the other stuff he does isnt good tbh.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etsq7ht",
                            "author": "blametheboogie",
                            "created": 1563152467.0,
                            "text": "He was just on the Lethal Weapon TV show.\nHe did those Goon movies.\nHe hasn't been in any big breakout hits but he seems to be working more or less steadily.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrzd6k",
                    "author": "Fuckoakwood",
                    "created": 1563132674.0,
                    "text": "Brendan Fraser after Journey to the Center of the Earth",
                    "replies": [
                        {
                            "id": "etsa5nz",
                            "author": "frostking79",
                            "created": 1563140322.0,
                            "text": "It wasn't a film that did him in....",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsfvhu",
                    "author": "ittleoff",
                    "created": 1563144527.0,
                    "text": "There are few tim Burton movies I would outright recommend. I usually like aspects of them. \n\nAlice no.  Charlie no.  Frankenweenie yes(liked it better than paranorman) Dumbo maybe(I found both it an alladin flawed but entertaining).   \nSleepy hollow mmm. Mars attacks. Not really.  Big fish yes?  \nThe one with kids and the house ?  Ehhhh maybe?\n\n\nSweeny Todd I really liked. \n\nAnyway I'm not sure if I can put my finger on what is wrong with his films for me. \n\nStory execution and editing? Never rising above the things he is obviously inspired by?",
                    "replies": []
                },
                {
                    "id": "etstk0o",
                    "author": "Welikeme23",
                    "created": 1563155146.0,
                    "text": "The movie “The Crow” killed Brandon Lee’s career",
                    "replies": []
                },
                {
                    "id": "etsetwf",
                    "author": "Repost_Hypocrite",
                    "created": 1563143755.0,
                    "text": "The Dark Knight cancelled Heath Ledger",
                    "replies": []
                },
                {
                    "id": "etry62c",
                    "author": "mtheaded102",
                    "created": 1563131830.0,
                    "text": "If I had to pick the biggest 180 I’d have to say Heath Ledger after TDK (The Dark Knight). He’s basically been nonexistent since he appeared in that trilogy",
                    "replies": [
                        {
                            "id": "etrymkf",
                            "author": "None",
                            "created": 1563132151.0,
                            "text": "Too soon",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsksr9",
                    "author": "GAWhizzle",
                    "created": 1563148237.0,
                    "text": "Heath Ledger wasn't in anything big after The Dark Knight.",
                    "replies": [
                        {
                            "id": "etsmehn",
                            "author": "OneUniqueUnicorn",
                            "created": 1563149485.0,
                            "text": "It's hard to star in things when you're dead.",
                            "replies": [
                                {
                                    "id": "etswxbs",
                                    "author": "hitchens123",
                                    "created": 1563157833.0,
                                    "text": "What about that dead actor in Rogue 1?",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etrxvqj",
                    "author": "happyflappypancakes",
                    "created": 1563131627.0,
                    "text": "I'd say Heath Ledger in The Dark Knight.",
                    "replies": []
                },
                {
                    "id": "ets8pe1",
                    "author": "None",
                    "created": 1563139287.0,
                    "text": "The Last Jedi.\nWhy is rian johnson still making movies?!",
                    "replies": []
                },
                {
                    "id": "etrk5sk",
                    "author": "None",
                    "created": 1563122861.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "etrlrks",
                            "author": "xroarxx",
                            "created": 1563123904.0,
                            "text": "Do you live under a rock dude?\n\nShe is mystique in the new xmen movies, and is a huge star?\n\nmother, red sparrow, passengers?",
                            "replies": [
                                {
                                    "id": "etrmu4g",
                                    "author": "trumpetbear",
                                    "created": 1563124599.0,
                                    "text": "American hustle, Joy, Serena, silver linings playbook",
                                    "replies": []
                                },
                                {
                                    "id": "ets0pjz",
                                    "author": "JokeCasual",
                                    "created": 1563133617.0,
                                    "text": "None of these movies have done particularly well though. The new Xmen bombed hard, opening with only 32m which is really bad.",
                                    "replies": [
                                        {
                                            "id": "ets18ct",
                                            "author": "xroarxx",
                                            "created": 1563133989.0,
                                            "text": "So? \n\nHis statement was that she hasn't been in a single movie since the hunger games.. nothing to do with her latest movies box office performance.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "etrmr7v",
                            "author": "PistonMilk",
                            "created": 1563124544.0,
                            "text": "Oh except all the new X-Men movies.\n  \n* Mother\n* American Hustle\n* Passengers\n* Joy\n\nShe is still extremely busy and extremely successful.",
                            "replies": [
                                {
                                    "id": "ets0wvc",
                                    "author": "JokeCasual",
                                    "created": 1563133760.0,
                                    "text": "She’s getting work but none of those movies are making huge money, and most are slammed by critics, other than American Hustle which was 6 years ago.",
                                    "replies": [
                                        {
                                            "id": "ets1g6z",
                                            "author": "xroarxx",
                                            "created": 1563134145.0,
                                            "text": "Passengers - budget 100-150 million, box office 303.1 million\n\nAmerican Hustle - Budget 40mill, box office 251.2 million USD\n\nFirst Class budget 150 mill, box office 353.6 million\n\nI can keep going but at this point I think it's obvious not only are you wrong, but you have absolutely no clue about shit.",
                                            "replies": [
                                                {
                                                    "id": "ets4xa9",
                                                    "author": "JokeCasual",
                                                    "created": 1563136621.0,
                                                    "text": "The Hunger Games came out after American Hustle/First Class, who doesn't know shit again?",
                                                    "replies": [
                                                        {
                                                            "id": "ets7z1j",
                                                            "author": "xroarxx",
                                                            "created": 1563138766.0,
                                                            "text": "American hustle was 2013\n\nHunger games 2012\n\nbrb gonna google the remaining xmen movies box office results for you\n\nEDIT:\nDays of future past budget 200mill box office 747.9 million USD\n\napocalypse 178 mill box office 543.9 million USD\n\nAny more questions??",
                                                            "replies": [
                                                                {
                                                                    "id": "ets8ui6",
                                                                    "author": "JokeCasual",
                                                                    "created": 1563139388.0,
                                                                    "text": "The last hunger games came out in 2015.\nYou're using movies from ages ago, her success peaked with those movies and has been going down hill since. Every new movie shes in makes less and less. Hell, Xmen is basically a dead franchise now after the last one until the reboot it at least, using Apocalypse as a marker for success is hilarious considering it was so hated that it destroyed all confidence in the IP and tanked Dark Phoenix by proxy.",
                                                                    "replies": [
                                                                        {
                                                                            "id": "ets9btp",
                                                                            "author": "xroarxx",
                                                                            "created": 1563139730.0,
                                                                            "text": "Ok we will literally ignore every movie since the hunger games.\n\nThe List is\n\n2015 \tJoy \tJoy Mangano \t\n2016 \tA Beautiful Planet \tNarrator \tDocumentary\n\n2016 \tX-Men: Apocalypse \tRaven Darkhölme / Mystique \t\n2016 \tPassengers \tAurora Lane \t\n2017 \tMother! \tMother \t\n2018 \tRed Sparrow \tDominika Egorova \t\n2019 \tDark Phoenix \tRaven Darkhölme / Mystique \t\nTBA \tUntitled Lila Neugebauer project\n\nThat's 1-3 movies A YEAR.\n\nSuch a dead career!\n\nPS Dark Phoenix tanked because the girl who plays jean sucks and she sucked in apoc too, not because of J law, nice try though.",
                                                                            "replies": [
                                                                                {
                                                                                    "id": "ets9isk",
                                                                                    "author": "JokeCasual",
                                                                                    "created": 1563139864.0,
                                                                                    "text": "1 movie in 2019 and you're telling me her career isn't going downhill?",
                                                                                    "replies": [
                                                                                        {
                                                                                            "id": "ets9rw5",
                                                                                            "author": "xroarxx",
                                                                                            "created": 1563140044.0,
                                                                                            "text": "Oh I'm sorry what was this post titled?\n\nWas it actors/actress's whos careers seem to be going downhill?\n\nNo it was Box office hits that destroyed people's careers.\n\nMove along now. Also shes rich af now and can be picky about the movies she does, she doesnt need the paycheck.. lots of actors slow down once they are no longer needing the money..",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etrzzcq",
                    "author": "None",
                    "created": 1563133110.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "ets0lwr",
                            "author": "cat_handcuffs",
                            "created": 1563133546.0,
                            "text": "My impression is that Daniel Radcliffe, being worth 100 million in his 20s, and one of the most recognizable faces in the world, works when he wants to, and usually in projects that intrigue him. He does quirky, artsy movies and theater. I’m guessing that even now he gets offers for bigger films, but doesn’t want to be that kind of actor.",
                            "replies": [
                                {
                                    "id": "ets1u3x",
                                    "author": "None",
                                    "created": 1563134423.0,
                                    "text": "[deleted]",
                                    "replies": [
                                        {
                                            "id": "ets4zrf",
                                            "author": "cat_handcuffs",
                                            "created": 1563136670.0,
                                            "text": "I liked Horns but I’m a fan of the book and of Joe Hill. Swiss Army Man is one of the weirdest things I have ever seen, and it almost worked for me. \n\nAs for the paparazzi, I heard he just like to fuck with them for fun. Like in NY during his broadway show, he wore the same clothes every night as he left the theater, which made that days pics identical to every other days, meaning they had no new pictures to sell.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ets3b03",
                            "author": "failinglikefalling",
                            "created": 1563135469.0,
                            "text": "He is damn good in that sitcom with Steve Buscami , Miracle Workers",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsbdev",
                    "author": "Bailie2",
                    "created": 1563141202.0,
                    "text": "Mel Gibson, passion of the christ",
                    "replies": []
                },
                {
                    "id": "etsfvka",
                    "author": "jmfranklin515",
                    "created": 1563144528.0,
                    "text": "Ben Affleck after Gigli. He disappeared from Hollywood for a while.",
                    "replies": [
                        {
                            "id": "etsia1m",
                            "author": "DoubtfulExaminer",
                            "created": 1563146334.0,
                            "text": "Argo, the Town, Batman vs Superman....really?",
                            "replies": [
                                {
                                    "id": "etsu0vz",
                                    "author": "jmfranklin515",
                                    "created": 1563155516.0,
                                    "text": "I said for a while, not forever,",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etsk4a4",
                    "author": "toonman77",
                    "created": 1563147717.0,
                    "text": "Val Kilmer after Batman Forever\nMatt Damon after Bourne Identity\nAmy Adams after Superman vs Batman\nWill Smith after I Legend",
                    "replies": []
                },
                {
                    "id": "etsk79f",
                    "author": "Spacegirlworld",
                    "created": 1563147779.0,
                    "text": "Men in black without Will Smith I thought was going to be a massive let down but it turned out to be pretty good.. I Love Liam in every film 😍",
                    "replies": [
                        {
                            "id": "etsn8on",
                            "author": "Saiaxs",
                            "created": 1563150138.0,
                            "text": "Liam Hemsworth? Chris Hemsworth is in MIB now\n\nEdit: you mean Liam Neeson I think, my bad",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrabo8",
                    "author": "zsquinten",
                    "created": 1563116279.0,
                    "text": "Asked my genius friend here what she thought and she said \"The Dark Knight\".  Definitely on her way to Hell.",
                    "replies": [
                        {
                            "id": "etrkr1d",
                            "author": "Riydon10",
                            "created": 1563123243.0,
                            "text": "She's a cunt.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrrb4c",
                    "author": "guy-with-name",
                    "created": 1563127419.0,
                    "text": "Pearl Harbor ruined Ben Affleck's acting reputation",
                    "replies": [
                        {
                            "id": "etrtzik",
                            "author": "ChinookNL",
                            "created": 1563129078.0,
                            "text": "Argo and The Town?",
                            "replies": [
                                {
                                    "id": "etrvwty",
                                    "author": "guy-with-name",
                                    "created": 1563130268.0,
                                    "text": "As an actor it ruined him",
                                    "replies": [
                                        {
                                            "id": "etryjgs",
                                            "author": "None",
                                            "created": 1563132090.0,
                                            "text": "Again, Argo and The Town.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "etryv69",
                            "author": "my_good_chum",
                            "created": 1563132320.0,
                            "text": "He was _the bomb_ in Phantoms",
                            "replies": []
                        },
                        {
                            "id": "etrvd9g",
                            "author": "None",
                            "created": 1563129911.0,
                            "text": "Ben Affleck ruined Ben Affleck's career",
                            "replies": []
                        },
                        {
                            "id": "etsd5py",
                            "author": "GangstaPepsi",
                            "created": 1563142512.0,
                            "text": "That was until he starred in Good Will Hunting 2: Hunting Season.",
                            "replies": []
                        },
                        {
                            "id": "ets057d",
                            "author": "jaysun13",
                            "created": 1563133223.0,
                            "text": "He became Batman",
                            "replies": []
                        },
                        {
                            "id": "ets2fz8",
                            "author": "None",
                            "created": 1563134859.0,
                            "text": "No",
                            "replies": []
                        },
                        {
                            "id": "etsbc97",
                            "author": "triforce721",
                            "created": 1563141179.0,
                            "text": "Lol, no, if anything, it was Daredevil",
                            "replies": []
                        },
                        {
                            "id": "ett1x9i",
                            "author": "Relandis",
                            "created": 1563161976.0,
                            "text": "No it didn't, Affleck could never act to begin with. Literally road Matt Damon's coattails to stardom.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrvuho",
                    "author": "shayan1232001",
                    "created": 1563130223.0,
                    "text": "Daniel Radcliffe after Harry Potter",
                    "replies": [
                        {
                            "id": "ets2346",
                            "author": "None",
                            "created": 1563134604.0,
                            "text": "He’s been in a lot of notable stuff since HP.  I don’t see him as only Harry anymore.  He’s an exceptional actor who luckily was not type casted after his initial success.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrvz6q",
                    "author": "None",
                    "created": 1563130313.0,
                    "text": "All the main Harry Potter cast",
                    "replies": []
                },
                {
                    "id": "etrzgdk",
                    "author": "CreamyDingleberry",
                    "created": 1563132735.0,
                    "text": "No mention of Fear and Loathing or Gilbert Grape? Those are the real gems of his career.",
                    "replies": [
                        {
                            "id": "ets00qz",
                            "author": "moreplastic",
                            "created": 1563133136.0,
                            "text": "Cuz they were way before alice in wonderland",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrzl70",
                    "author": "None",
                    "created": 1563132833.0,
                    "text": "Linda Blair in the exorcist? Although she was just a kid at the time..",
                    "replies": []
                },
                {
                    "id": "ets2agl",
                    "author": "None",
                    "created": 1563134747.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "ets35yp",
                            "author": "Always_Bardownski",
                            "created": 1563135370.0,
                            "text": "Could be wrong but I think it’s the pedophilia and sexual assault that took Spacey off the map",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "ets36s7",
                    "author": "LivinginthePit",
                    "created": 1563135386.0,
                    "text": "Didn’t they make a sequel to that movie? Why?",
                    "replies": []
                },
                {
                    "id": "ets45wi",
                    "author": "None",
                    "created": 1563136077.0,
                    "text": "Planet of the Apes destroyed Burton’s career. Whatever integrity he had was gone. God I hate that fucking movie.",
                    "replies": [
                        {
                            "id": "etsh3vu",
                            "author": "CelebrityTakeDown",
                            "created": 1563145445.0,
                            "text": "He made several acclaimed movies after that, including Corpse Bride.\n\nThe downturn was Charlie and the Chocolate Factory.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsayhc",
                    "author": "is_this_illegal_",
                    "created": 1563140902.0,
                    "text": "Daniel Radcliffe after Harry Potter.",
                    "replies": []
                },
                {
                    "id": "etsfd5w",
                    "author": "agnitaaac",
                    "created": 1563144146.0,
                    "text": "What about Michael Fassbender and 12 Years a Slave/X-men?",
                    "replies": [
                        {
                            "id": "etsowhz",
                            "author": "Saiaxs",
                            "created": 1563151438.0,
                            "text": "He was in the latest X-Men disaster last month",
                            "replies": [
                                {
                                    "id": "etwottm",
                                    "author": "agnitaaac",
                                    "created": 1563279609.0,
                                    "text": "that's why I said him, his career has been shit ever since 12 years a slave :(",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etsfuld",
                    "author": "sanirosan",
                    "created": 1563144508.0,
                    "text": "Emma watson. After Harry Potter she hasn’t dine any bug movies. I remember her in a movie about LA kids stealing stuff or something but that’s it.\n\nAlthough, her career didnt tank as she wanted to finish college etc, but it’s a shame. She’s very likable and can act.",
                    "replies": [
                        {
                            "id": "etsgozg",
                            "author": "None",
                            "created": 1563145137.0,
                            "text": "Umm, Beauty & The Beast made a billion dollars.",
                            "replies": []
                        },
                        {
                            "id": "etsh87k",
                            "author": "potatoesinsunshine",
                            "created": 1563145534.0,
                            "text": "Beauty and the Beast was pretty recent and made a ton of money? Perks of Being a Wallflower was super hot for my age group that had read the book a few years before.",
                            "replies": [
                                {
                                    "id": "etshhsn",
                                    "author": "sanirosan",
                                    "created": 1563145737.0,
                                    "text": "Perks was a year after Harry Potter ( good movie btw) and beauty and the Beast was indeed recent. But in all those years, nothing huge had happened.",
                                    "replies": [
                                        {
                                            "id": "etshytl",
                                            "author": "potatoesinsunshine",
                                            "created": 1563146097.0,
                                            "text": "But what part of beauty and the beast wasn’t huge?! She’s officially a disney princess and probably has contacts within one of the biggest studios who’ll want to work with her again. Paige O’Hara, the original voice of Belle, was commission but disney to create a painting of Emma as Belle. Didn’t she also costar with Tom Hanks in something? That’s a huge thing for a young actor. \n\nThe question is about careers being ruined/flopping. Not whether every movie she ever does will be as universally famous as Harry Potter. I just googled and she’s in a new Little Women movie coming out this Christmas. I’d hardly call her post HP career a flop at this point.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etsi88v",
                    "author": "doctazeus",
                    "created": 1563146295.0,
                    "text": "Unplanned. Bunch of Neanderthals setting humanity backwards.",
                    "replies": []
                },
                {
                    "id": "etsjyno",
                    "author": "cherbug",
                    "created": 1563147599.0,
                    "text": "James Woods. I think when he played Giuliani it was curtains for crazy jimmy.",
                    "replies": []
                },
                {
                    "id": "etsl9gb",
                    "author": "djaym7",
                    "created": 1563148597.0,
                    "text": "People and animals of India getting killed because of success of Salman Khan at box office!",
                    "replies": []
                },
                {
                    "id": "etsmi0w",
                    "author": "figl4567",
                    "created": 1563149560.0,
                    "text": "Mark Hamil",
                    "replies": []
                },
                {
                    "id": "etsntcq",
                    "author": "szb",
                    "created": 1563150586.0,
                    "text": "Kevin Bacon in Tremors.",
                    "replies": []
                },
                {
                    "id": "etsot8s",
                    "author": "autmnleighhh",
                    "created": 1563151368.0,
                    "text": "I think you’re making assumptions by saying “destroyed people’s careers”\n\nUnless some has explicitly said so, we don’t know why they aren’t producing big box office hits. \n\nSome people get tired of the BS that involved with dealing with the studios that commonly release these hits.",
                    "replies": []
                },
                {
                    "id": "etsva54",
                    "author": "None",
                    "created": 1563156513.0,
                    "text": "Dumbo made 352m on a 171m budget. How is that a flop?\n\nAnyways, if we're going by flops, the Wachowskis haven't really had a hit film after The Matrix in terms of box office success. SpeedRacer lost 30 mill, Cloud Atlas lost 16 mill, and Jupiter Ascending lost around 16 mill as well. Sense8 did \"ok\", but it's not widely known or popular among TV shows.",
                    "replies": [
                        {
                            "id": "etsvlaq",
                            "author": "Darkslayer18264",
                            "created": 1563156765.0,
                            "text": "171 million, plus however much for marketing.\n\nThen you have to split that box office with the cinemas, so it probably didn’t turn a huge profit for Disney, if any.",
                            "replies": [
                                {
                                    "id": "etsw0pw",
                                    "author": "None",
                                    "created": 1563157110.0,
                                    "text": "I heard that films don't pay much to cinemas in terms of royalty fees or buying out theaters. Most of cinema profits come from food/drink sales compared to ticket sales. That's why they charge $6.00 for a box of Skittles. Marketing however was probably at least another 50 million, so you're correct on that.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etsx5hh",
                            "author": "mranimal2",
                            "created": 1563158019.0,
                            "text": "I said Burton's movies since have flopped or underperformed. That's an example of a movie that underperformed rather than bombed. Considering the cash a lot of the Disney remakes have been making, and that Dumbo is a pretty well known movie, I think people were expecting a higher box office gross than $352 million. It's not awful but it's no Beauty and the Beast 2017 or even Cinderella 2015.",
                            "replies": []
                        },
                        {
                            "id": "etszev6",
                            "author": "btouch",
                            "created": 1563159837.0,
                            "text": "Shazam! made more on a budget that was about 40% smaller and yet it’s still called a flop on Reddit.",
                            "replies": []
                        },
                        {
                            "id": "ett0uxh",
                            "author": "Tsunnyjim",
                            "created": 1563161058.0,
                            "text": "Most big films generally need to make 2.5 times their budget to be profitable. This covers the marketing for the theatrical release as well as initial production costs for merch and home media release.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsw6ci",
                    "author": "chrisk722",
                    "created": 1563157235.0,
                    "text": "The kill bill where Uma Thurman crashed the car, she sued and shit... ruined her reputation with the Hollywood crew sorta I think she is just a bad driver but then again what do I know I’m kinda talking outa my ass anyway",
                    "replies": []
                },
                {
                    "id": "ett64hm",
                    "author": "thesecondbicycle",
                    "created": 1563165876.0,
                    "text": "Daniel Radcliffe?",
                    "replies": [
                        {
                            "id": "ettdf35",
                            "author": "dominion1080",
                            "created": 1563174356.0,
                            "text": "What major film has he done since Potter?  I feel he's moved towards smaller films on purpose.",
                            "replies": []
                        },
                        {
                            "id": "ettt9cd",
                            "author": "Rosebunse",
                            "created": 1563195291.0,
                            "text": "His career is fine. He seemingly wanted to stick to smaller indy roles because, for one, he can afford to do whatever he wants, and because he likes them.\n\nHe has his money, he has his fame, so there's no reason for him to go after bigger projects. He knows he could have his pick if he wanted.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrpqb1",
                    "author": "CommodoreKrusty",
                    "created": 1563126434.0,
                    "text": "Episode VIII might have destroyed some careers. Here's hoping.",
                    "replies": [
                        {
                            "id": "etrvpww",
                            "author": "None",
                            "created": 1563130137.0,
                            "text": "Just because you disliked a movie doesnt mean careers should be destroyed",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsbk1n",
                    "author": "jimmybananahamok",
                    "created": 1563141335.0,
                    "text": "The Crow really did a number on Brandon Lee's career.",
                    "replies": []
                },
                {
                    "id": "etsytpb",
                    "author": "metroid12321",
                    "created": 1563159363.0,
                    "text": "Brandon Lee in The Crow.  \nHeath Ledger in the Dark Knight.  \n\nTheir career definitely died after those movies",
                    "replies": []
                },
                {
                    "id": "ets0fkz",
                    "author": "AmadeusK482",
                    "created": 1563133423.0,
                    "text": ">Alice in Wonderland\n\n>Citizen Kane\n\n>Dumbo!\n\n\nAll of these movies were originally for the largely white middle-income movie going demographic in the baby boomer era.\n\nMaybe thats why audiences today do not care about them.",
                    "replies": [
                        {
                            "id": "ets4tv0",
                            "author": "Esquimo_UK",
                            "created": 1563136554.0,
                            "text": ">>baby boomer era\n\nCitizen Kane and Dumbo were both released in 1941. They weren’t aimed at Baby Boomers, they were aimed at their parents.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsh2oz",
                    "author": "None",
                    "created": 1563145419.0,
                    "text": "[deleted]",
                    "replies": [
                        {
                            "id": "etsmalg",
                            "author": "AskMeAboutMyStalker",
                            "created": 1563149400.0,
                            "text": "Yeah all that Emmy nominated work with Pitt & DiCaprio has really jammed up his career, poor guy",
                            "replies": []
                        },
                        {
                            "id": "etsokc5",
                            "author": "aresef",
                            "created": 1563151172.0,
                            "text": "He’s actually had a long career doing many different kinds of films. You don’t just skate into the sort of movies he’s done like Moneyball and Wolf of Wall Street.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsj3mw",
                    "author": "MisterBadIdea2",
                    "created": 1563146948.0,
                    "text": "If you believe the rumors, The Dark Knight was a massive hit but directly caused the end of Heath Ledger's career in a pretty permanent way",
                    "replies": []
                },
                {
                    "id": "etsl9be",
                    "author": "Negs01",
                    "created": 1563148594.0,
                    "text": "The Crow destroyed Brandon Lee's career.  Although I don't think that is quite what you meant.",
                    "replies": []
                },
                {
                    "id": "etrz5pj",
                    "author": "adilodovico",
                    "created": 1563132527.0,
                    "text": "Daniel Radcliffe, didn’t really make any impact after the Harry Potter movies",
                    "replies": [
                        {
                            "id": "etrzmaw",
                            "author": "lordjollygreen",
                            "created": 1563132855.0,
                            "text": "He's choosing to take smaller, more obscure roles to expand his opportunities and to avoid being type casted. Basically he's avoiding the big box office movies on purpose.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrzkb5",
                    "author": "TrumperCR",
                    "created": 1563132814.0,
                    "text": "Every actor from Game of Thrones",
                    "replies": []
                },
                {
                    "id": "ets26eb",
                    "author": "None",
                    "created": 1563134667.0,
                    "text": "Not a movie but what the hell happened to James Gandolfini after the Sopranos?",
                    "replies": [
                        {
                            "id": "ets3x0z",
                            "author": "DreamBrother1",
                            "created": 1563135903.0,
                            "text": "Died in 2013",
                            "replies": [
                                {
                                    "id": "ets44y5",
                                    "author": "None",
                                    "created": 1563136059.0,
                                    "text": "The show ended in 2007",
                                    "replies": [
                                        {
                                            "id": "ets63u9",
                                            "author": "None",
                                            "created": 1563137445.0,
                                            "text": "he made some good stuff post Sopranos. The Drop, Zero Dark Thirty, Enough Said",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ets41rc",
                    "author": "utrocks20",
                    "created": 1563135996.0,
                    "text": "Daniel Radcliffe after the Harry Potter series.",
                    "replies": [
                        {
                            "id": "ets4xxg",
                            "author": "ohnotom",
                            "created": 1563136634.0,
                            "text": "Eh, id say there's a difference between box office flops that ruin careers vs child actors not becoming superstars in adulthood. And even then, Radcliffe has more or less intentionally avoided big blockbuster stuff and opted for smaller \"artsy\" roles, and has had reasonable success in that field.  Watch Swiss Army Man it you haven't.",
                            "replies": [
                                {
                                    "id": "ets5tjn",
                                    "author": "revelation6viii",
                                    "created": 1563137246.0,
                                    "text": "Agreed. He doesn't have the financial need after HP to do anything other than what he has a passion to get into.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "ets4d4g",
                            "author": "Turbobutts",
                            "created": 1563136223.0,
                            "text": "Because his career prior to Harry Potter was booming.",
                            "replies": [
                                {
                                    "id": "ets4lcg",
                                    "author": "utrocks20",
                                    "created": 1563136387.0,
                                    "text": "Ehh yeah that’s pretty fair.",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etsapmt",
                    "author": "Xmeromotu",
                    "created": 1563140722.0,
                    "text": "Sixth Sense - M. Night Shyamalan. Expectations for the rest of his movies were set so high there was no way he was going to live up to them. He hasn’t, and he’s never had a real hit since.",
                    "replies": []
                },
                {
                    "id": "etsn5b8",
                    "author": "Oulblueeyes48",
                    "created": 1563150065.0,
                    "text": "Heath ledger never really had a hit after The Dark Night. Which is a shame really, I think we can all agree he was pretty good.",
                    "replies": []
                },
                {
                    "id": "etsvele",
                    "author": "MooseTendies",
                    "created": 1563156614.0,
                    "text": "Paul Walker- Fast and the Furious",
                    "replies": []
                },
                {
                    "id": "ett1nzg",
                    "author": "ZeroKule",
                    "created": 1563161751.0,
                    "text": "fc0b65d20f92598555541a5399556cdfd2b07c585d9ae45bb0b9145a7052107d",
                    "replies": [
                        {
                            "id": "ettfz76",
                            "author": "None",
                            "created": 1563177840.0,
                            "text": "Brandon Lee - The Crow",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etqwye8",
                    "author": "Huddlestap",
                    "created": 1563105503.0,
                    "text": "Mel Gibson with The Passion of the Christ.",
                    "replies": [
                        {
                            "id": "etqxfbd",
                            "author": "CapnSmite",
                            "created": 1563105987.0,
                            "text": "*That's* not what killed Mel Gibson's career.",
                            "replies": [
                                {
                                    "id": "etr9ibb",
                                    "author": "None",
                                    "created": 1563115717.0,
                                    "text": "It did kinda kill Jim Caviezel's tho",
                                    "replies": [
                                        {
                                            "id": "etracp2",
                                            "author": "CapnSmite",
                                            "created": 1563116298.0,
                                            "text": "Hurt, maybe. I dunno about destroyed. He had a pretty decent run on CBS for several years.",
                                            "replies": []
                                        },
                                        {
                                            "id": "etre7wl",
                                            "author": "TheTrueRory",
                                            "created": 1563118929.0,
                                            "text": "I've also heard he can be difficult to work with, due to his deep religious beliefs. Like he's had scenes rewritten because of it.",
                                            "replies": [
                                                {
                                                    "id": "ets3a43",
                                                    "author": "picoSimone",
                                                    "created": 1563135452.0,
                                                    "text": "Wasn’t he struck by lightning twice on location of Passion?  I’m curious how his belief system dealt with that bit of bad luck.",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "etrkuy5",
                                    "author": "CanadiangirlEH",
                                    "created": 1563123312.0,
                                    "text": "Pretty sure it was the alcoholism and anti Semitic ranting.",
                                    "replies": []
                                },
                                {
                                    "id": "etqxpq1",
                                    "author": "Huddlestap",
                                    "created": 1563106285.0,
                                    "text": "It was. People will forgive angry, possibly drunken behavior and slurs. Look at Sean Penn or Alec Baldwin. But when it happened with Gibson, people could look at his anti-Semitic comments to the officer as part of a larger pattern, including the previous criticism about how Jewish characters were portrayed in the film. It also harmed his reputation among those who, because of the film, admired him as a decent Christian in godless Hollywood",
                                    "replies": [
                                        {
                                            "id": "etr0mno",
                                            "author": "TeamStark31",
                                            "created": 1563108992.0,
                                            "text": "There were other instances with Gibson, though, not just that one.",
                                            "replies": [
                                                {
                                                    "id": "etrqn9x",
                                                    "author": "jupiterscock1987",
                                                    "created": 1563127004.0,
                                                    "text": "He was raised by a very prominent Holocaust denier, whose beliefs are at least somewhat in line with his own. As you say, it didn't take that one DUI to let everyone know Mel Gibson's an anti-semite.",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "etrjfvn",
                            "author": "None",
                            "created": 1563122395.0,
                            "text": "Idk.. I consider Hacksaw Ridge a success.",
                            "replies": [
                                {
                                    "id": "etrqoa3",
                                    "author": "jupiterscock1987",
                                    "created": 1563127021.0,
                                    "text": "Fantastic movie.",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etrxj4t",
                    "author": "NoBackgroundNeeded",
                    "created": 1563131383.0,
                    "text": "L.",
                    "replies": []
                },
                {
                    "id": "ets2jhq",
                    "author": "_RAWFFLES_",
                    "created": 1563134929.0,
                    "text": "Being so good a playing Joffrey in GoT, Jackie Gleason can’t get acting jobs anymore.",
                    "replies": [
                        {
                            "id": "ets3nip",
                            "author": "sl1878",
                            "created": 1563135713.0,
                            "text": "Um, he quit acting by choice.",
                            "replies": [
                                {
                                    "id": "ets41mu",
                                    "author": "_RAWFFLES_",
                                    "created": 1563135994.0,
                                    "text": "Didn’t he quit partially in part, due to not being able to get any other roles that weren’t similar archetypes?",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "ets3uf4",
                            "author": "aresef",
                            "created": 1563135852.0,
                            "text": "He just doesn’t want to, I thought.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etsv7zn",
                    "author": "Di3zurg",
                    "created": 1563156465.0,
                    "text": "Jim from The Office. Aka John Krasinski",
                    "replies": []
                },
                {
                    "id": "etsx8lx",
                    "author": "cactusdodge",
                    "created": 1563158091.0,
                    "text": "Heath Ledger - The Dark Knight",
                    "replies": [
                        {
                            "id": "etsy3c6",
                            "author": "None",
                            "created": 1563158787.0,
                            "text": "Too soon!",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrieuz",
                    "author": "r0ndy",
                    "created": 1563121716.0,
                    "text": "Destroyed a career in what way? Like Luke sky walker, I mean... actually I don’t know his name. Type cast forever for star wars. Daniel Radcliffe is having trouble getting out as well. So destroyed a career, or just, majorly impeded and stumped it.",
                    "replies": [
                        {
                            "id": "etrjuyy",
                            "author": "Algaean",
                            "created": 1563122667.0,
                            "text": "Mark Hamill ;)",
                            "replies": [
                                {
                                    "id": "etrjy93",
                                    "author": "r0ndy",
                                    "created": 1563122724.0,
                                    "text": "Yes! Thank you, brain farts are serious",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "id": "etrn4y0",
                            "author": "StudioDraven",
                            "created": 1563124789.0,
                            "text": "Mark Hamill moved into voice acting. Ever watched the animated Batman series, or played the Arkham games? He's The Joker.\n\nhttps://www.imdb.com/name/nm0000434/\n\nHis career is anything but dead.",
                            "replies": [
                                {
                                    "id": "etryq92",
                                    "author": "r0ndy",
                                    "created": 1563132223.0,
                                    "text": "Hmm I see your point. I think i was looking at it like, Tom cruise or someone who regular appears in theaters",
                                    "replies": [
                                        {
                                            "id": "ets1yqq",
                                            "author": "StudioDraven",
                                            "created": 1563134515.0,
                                            "text": "I can see how you could do that, yeah. People sometimes don’t realise that careers can take some very unexpected turns.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "etrohrv",
                            "author": "Darkslayer18264",
                            "created": 1563125648.0,
                            "text": "Daniel Radcliffe just takes projects that interest him. I wouldn’t say it’s killed his career, he just has enough money that he can afford to take only the roles he wants.",
                            "replies": [
                                {
                                    "id": "ets6crz",
                                    "author": "r0ndy",
                                    "created": 1563137617.0,
                                    "text": "Would you still consider that a career or a hobby/passion?  By definition, a career has opportunities to progress. Lead actor vs supporting?",
                                    "replies": [
                                        {
                                            "id": "etsm6k2",
                                            "author": "Darkslayer18264",
                                            "created": 1563149311.0,
                                            "text": "I mean he still has the leading role in the majority of projects he’s in, he’s just not chasing down the huge blockbusters that’ll plaster his face all over Time Square.\n\nI think career progression for acting is largely relative once you hit “proper” tv and movie roles. It’s not like a company job with pay bands and a hierarchy and role progression. You could just career progression in a whole bunch of ways. Critical response, awards, net worth etc etc\n\nZoe Saldana’s been in three out of the top five highest grossing movies of all time, but Robert Downey Jr is the one getting 75 million for Endgame",
                                            "replies": [
                                                {
                                                    "id": "etsnb9h",
                                                    "author": "r0ndy",
                                                    "created": 1563150194.0,
                                                    "text": "Then yes, absolutely right. I was thinking type cast. Thank you!",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "etrnc0h",
                            "author": "DrZoidberg26",
                            "created": 1563124915.0,
                            "text": "Yeah but those roles made their careers, your examples are more of actors whose first role defined their careers than ruined them.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "etrimd3",
                    "author": "Osuwrestler",
                    "created": 1563121855.0,
                    "text": "Citizen Kane sucked",
                    "replies": [
                        {
                            "id": "etrkiws",
                            "author": "Sorocco",
                            "created": 1563123095.0,
                            "text": "Talking mad shit for someone in banning distance",
                            "replies": [
                                {
                                    "id": "etrkl96",
                                    "author": "Osuwrestler",
                                    "created": 1563123137.0,
                                    "text": "Not sure what you mean by that, but did you honestly like it?",
                                    "replies": [
                                        {
                                            "id": "etrur84",
                                            "author": "Sorocco",
                                            "created": 1563129534.0,
                                            "text": "Just being a troll. I’m a bad person. Upvote this man he’s not evil. I am",
                                            "replies": [
                                                {
                                                    "id": "etrv6jm",
                                                    "author": "Osuwrestler",
                                                    "created": 1563129794.0,
                                                    "text": "Thanks",
                                                    "replies": [
                                                        {
                                                            "id": "etrw5lw",
                                                            "author": "Sorocco",
                                                            "created": 1563130434.0,
                                                            "text": "It just seemed like a funny comment to make",
                                                            "replies": [
                                                                {
                                                                    "id": "etrw6s2",
                                                                    "author": "Osuwrestler",
                                                                    "created": 1563130457.0,
                                                                    "text": "It’s all good",
                                                                    "replies": [
                                                                        {
                                                                            "id": "etrw7ok",
                                                                            "author": "Sorocco",
                                                                            "created": 1563130474.0,
                                                                            "text": "<3",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etrpzlr",
                    "author": "None",
                    "created": 1563126596.0,
                    "text": "Wut",
                    "replies": []
                },
                {
                    "id": "etrqx89",
                    "author": "RugskinProphet",
                    "created": 1563127180.0,
                    "text": "Passion of the Christ. I think Mel Gibson told the main character he wouldn’t be able to get an acting role after the movie because everyone would see him as Jesus from that one movie.",
                    "replies": [
                        {
                            "id": "etrvmtv",
                            "author": "None",
                            "created": 1563130080.0,
                            "text": "Yeah? 5 seasons of Person of Interest say otherwise",
                            "replies": [
                                {
                                    "id": "etrvu0i",
                                    "author": "RugskinProphet",
                                    "created": 1563130214.0,
                                    "text": "Is it worth watching? My brother says it’s good",
                                    "replies": [
                                        {
                                            "id": "etrynnp",
                                            "author": "None",
                                            "created": 1563132173.0,
                                            "text": "I enjoyed it",
                                            "replies": []
                                        },
                                        {
                                            "id": "ets7v8l",
                                            "author": "Fomenkologist",
                                            "created": 1563138692.0,
                                            "text": "It's really good, especially once the main story arc kicks in",
                                            "replies": [
                                                {
                                                    "id": "etse47m",
                                                    "author": "RugskinProphet",
                                                    "created": 1563143227.0,
                                                    "text": "You convinced me. Adding it to my list haha",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "etrvs3k",
                                    "author": "RugskinProphet",
                                    "created": 1563130178.0,
                                    "text": "Cool 🤷🏻‍♂️",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "etrzqrc",
                    "author": "redditsgarbageman",
                    "created": 1563132944.0,
                    "text": "If you asked this question 10 years in the future, a lot of Marvel characters will be on this list. That movie has type-cast dozens of people that will struggle to expand past those rolls. Which is why they got such phenomenal pay checks.",
                    "replies": []
                },
                {
                    "id": "ets444a",
                    "author": "mexdizzle",
                    "created": 1563136042.0,
                    "text": "The Dark Knight. Heath Ledger was never the same after.",
                    "replies": []
                },
                {
                    "id": "etsel4j",
                    "author": "Redman_Goldblend",
                    "created": 1563143574.0,
                    "text": "Keanu Reeves in wick movie",
                    "replies": [
                        {
                            "id": "etseplc",
                            "author": "None",
                            "created": 1563143666.0,
                            "text": "I dont think they destroyed his career in the slightest.",
                            "replies": []
                        }
                    ]
                },
                {
                    "id": "ifdj1cp",
                    "author": "Which-Sir372",
                    "created": 1657304484.0,
                    "text": "I guess the biggest case would be The Exorcist for Linda Blair. It was too much to ever be casted again in anything else after.",
                    "replies": []
                }
            ]
        },
        {
            "title": "Please tell me I’m not the only who loves this movie",
            "submission_id": "1akc4jk",
            "author": "Tonyboy200716",
            "score": 617,
            "created": 1707232598.0,
            "text": "I think  i actually like this more then I do the animated one even though I still do love that one",
            "comments": [
                {
                    "id": "kp6w9ah",
                    "author": "lzardonaleash",
                    "created": 1707234813.0,
                    "text": "You’re not. While the second one was just so-so, this one was awesome. Especially the costuming. The casting is terrific, too.",
                    "replies": [
                        {
                            "id": "kpcxnyd",
                            "author": "Prince111497",
                            "created": 1707327578.0,
                            "text": "Yeah this one is actually decent compared to the sequel",
                            "replies": [
                                {
                                    "id": "kpd8vue",
                                    "author": "shadowsadvancing",
                                    "created": 1707331304.0,
                                    "text": "The sequel is okay in my opinion, but definitely a disappointment compared to the first movie. If I had seen the movies out of order, I think I would hold the sequel in higher opinion",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}